app/Http/Middleware/freeAccount.php

SELECT * FROM `payments` WHERE `payments`.`id` = 3 LIMIT 1
SELECT * FROM `users` WHERE `id` = 3 LIMIT 1
---
    public function handle(Request $request, Closure $next): Response
    {
        $user = User::where('id', auth()->user()->id)->with('payment')->first();