routes/web.php

SELECT `kategori_transaksis`.`nama`, `anggarans`.`jumlah` FROM `anggarans` inner join `kategori_transaksis` on `anggarans`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `anggarans`.`user_id` = 3 GROUP BY `anggarans`.`jumlah`, `kategori_transaksis`.`nama`
---
        Route::get('/get_anggaran_by_id', 'api');

        Route::get('/get_all_anggaran', function() {
            $records = Anggaran::join('kategori_transaksis', 'anggarans.kategori_transaksi_id', '=', 'kategori_transaksis.id')
                                ->where('anggarans.user_id', auth()->user()->id)
                                ->select(
                                    'kategori_transaksis.nama',
                                    'anggarans.jumlah'
                                )
                                ->groupBy('anggarans.jumlah', 'kategori_transaksis.nama')
                                ->get();