app/Helper/DatabaseHelper.php

SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 3 and `jenis_transaksi_id` in (1, 2) and `void` = 0
---
    public static function getPendapatan()
    {

        $transaksi = Transaksi::where('user_id', auth()->user()->id)
            ->whereIn('jenis_transaksi_id', [1, 2])
            ->where('void', false)
            ->sum('jumlah');

SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 3 and `jenis_transaksi_id` in (1, 2) and `void` = 0 and month(`tanggal`) = '12'
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 2 and `jenis_transaksi_id` in (1, 2) and `void` = 0 and month(`tanggal`) = '12'
SELECT `nama`, `id`, (51445004 * value / 100) AS jumlah FROM `kategori_anggarans` WHERE `user_id` = 3
---
    public static function getJumlahBudgeting()
    {
        $jumlahPendapatanTransaksi = Transaksi::where('user_id', auth()->user()->id)
            ->whereIn('jenis_transaksi_id', [1, 2])
            ->where('void', false)
            ->whereMonth('tanggal', DatabaseHelper::getMonth())
            ->sum('jumlah');


        $jumlahBudgeting = Kategori_anggaran::select(
            'nama',
            'id',
            DB::raw("($jumlahPendapatanTransaksi * value / 100) AS jumlah")
        )
            ->where('user_id', auth()->user()->id)

SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 3 and `jenis_transaksi_id` in (1, 2) and `void` = 0 and month(`tanggal`) = '12'
SELECT `kategori_anggarans`.`id` as `id_kategori_anggaran`, `kategori_anggarans`.`value`, SUM(transaksis.jumlah) as total_jumlah FROM `kategori_anggarans` left join `anggarans` on `kategori_anggarans`.`id` = `anggarans`.`kategori_anggaran_id` left join `transaksis` on `anggarans`.`kategori_transaksi_id` = `transaksis`.`kategori_transaksi_id` WHERE `anggarans`.`user_id` = 1 and `transaksis`.`user_id` = 1 and `transaksis`.`void` = 0 and month(`transaksis`.`tanggal`) = '12' GROUP BY `kategori_anggarans`.`id`, `kategori_anggarans`.`value`
SELECT `kategori_anggarans`.`id` as `id_kategori_anggaran`, `kategori_anggarans`.`value`, SUM(transaksis.jumlah) as total_jumlah FROM `kategori_anggarans` left join `anggarans` on `kategori_anggarans`.`id` = `anggarans`.`kategori_anggaran_id` left join `transaksis` on `anggarans`.`kategori_transaksi_id` = `transaksis`.`kategori_transaksi_id` WHERE `anggarans`.`user_id` = 3 and `transaksis`.`user_id` = 3 and `transaksis`.`void` = 0 and month(`transaksis`.`tanggal`) = '12' GROUP BY `kategori_anggarans`.`id`, `kategori_anggarans`.`value`
SELECT * FROM `kategori_anggarans` WHERE `user_id` = 3
---
    public static function getPersentaseBudgeting()
    {
        $jumlahPendapatanTransaksi = Transaksi::where('user_id', auth()->user()->id)
            ->whereIn('jenis_transaksi_id', [1, 2])
            ->where('void', false)
            ->whereMonth('tanggal', DatabaseHelper::getMonth())
            ->sum('jumlah');

        $records = DB::table('kategori_anggarans')
            ->where('anggarans.user_id', auth()->user()->id)
            ->leftJoin('anggarans', 'kategori_anggarans.id', '=', 'anggarans.kategori_anggaran_id')
            ->leftJoin('transaksis', 'anggarans.kategori_transaksi_id', '=', 'transaksis.kategori_transaksi_id')
            ->where('transaksis.user_id', auth()->user()->id)
            ->where('transaksis.void', false)
            ->whereMonth('transaksis.tanggal', DatabaseHelper::getMonth())
            ->select(
                'kategori_anggarans.id AS id_kategori_anggaran',
                'kategori_anggarans.value',
                DB::raw('SUM(transaksis.jumlah) as total_jumlah')
            )
            ->groupBy('kategori_anggarans.id', 'kategori_anggarans.value')
            ->get();



        $getKategoriAnggaran = Kategori_anggaran::where('user_id', auth()->user()->id)->get();

SELECT `anggarans`.`kategori_transaksi_id`, SUM(transaksis.jumlah) / anggarans.jumlah * 100 AS persentase FROM `transaksis` inner join `anggarans` on `transaksis`.`kategori_transaksi_id` = `anggarans`.`kategori_transaksi_id` WHERE `transaksis`.`user_id` = 3 and `transaksis`.`void` = 0 and `anggarans`.`user_id` = 3 and month(`transaksis`.`tanggal`) = '12' GROUP BY `transaksis`.`kategori_transaksi_id`, `anggarans`.`kategori_transaksi_id`, `anggarans`.`jumlah`, `transaksis`.`kategori_transaksi_id`
SELECT * FROM `anggarans` WHERE `user_id` = 3
---
    public static function getPersentaseAnggaran($string)
    {

        $persentaseAnggarans = Transaksi::join('anggarans', 'transaksis.kategori_transaksi_id', '=', 'anggarans.kategori_transaksi_id')
            ->where('transaksis.user_id', auth()->user()->id)
            ->where('transaksis.void', false)
            ->where('anggarans.user_id', auth()->user()->id)
            ->whereMonth('transaksis.tanggal', DatabaseHelper::getMonth())
            ->select(
                'anggarans.kategori_transaksi_id',
                DB::raw('SUM(transaksis.jumlah) / anggarans.jumlah * 100 AS persentase')
            )
            ->groupBy('transaksis.kategori_transaksi_id', 'anggarans.kategori_transaksi_id', 'anggarans.jumlah', 'transaksis.kategori_transaksi_id')
            ->get();

SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `tanggal` between '2023-11-01' and '2023-11-30' and `jenis_transaksi_id` = 1 and `user_id` = 3 and `void` = 0
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `tanggal` between '2023-12-01' and '2023-12-12' and `jenis_transaksi_id` = 1 and `user_id` = 3 and `void` = 0
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 1 and `void` = 0 and month(`tanggal`) = '12' and `jenis_transaksi_id` = 1
---
    public static function getPersentasePerbandinganDaily()
    {
        $getId = auth()->user()->id;
        $getYesterday = Carbon::today()->format('Y-m-d');
        $getMinusTwoDay = Carbon::yesterday()->format('Y-m-d');
        $getTotalPendapatanYesterday = Transaksi::where('tanggal', $getYesterday)->where('jenis_transaksi_id', [1, 2])->where('user_id', $getId)->where('void', false)->select(
            'jumlah'
        )
            ->sum('jumlah');
        $getTotalPendapatanMinusTwoDay = Transaksi::where('tanggal', $getMinusTwoDay)->where('jenis_transaksi_id', [1, 2])->where('user_id', $getId)->where('void', false)->select('jumlah')->sum('jumlah');
        $getTotalPengeluaranYesterday = Transaksi::where('tanggal', $getYesterday)->where('jenis_transaksi_id', [3, 4])->where('user_id', $getId)->where('void', false)->select('jumlah')->sum('jumlah');
        $getTotalPengeluaranMinusTwoDay = Transaksi::where('tanggal', $getMinusTwoDay)->where('jenis_transaksi_id', [3, 4])->where('user_id', $getId)->where('void', false)->select('jumlah')->sum('jumlah');
        $getSaldoYesterday = $getTotalPendapatanYesterday - $getTotalPengeluaranYesterday;
        $getSaldoMinusTwoDay = $getTotalPendapatanMinusTwoDay - $getTotalPengeluaranMinusTwoDay;
        $getSelisihPendapatan = ($getTotalPendapatanYesterday - $getTotalPendapatanMinusTwoDay);
        $persentaseSelisihPendapatan = $getTotalPendapatanMinusTwoDay > 0 ? round(($getSelisihPendapatan / $getTotalPendapatanMinusTwoDay) * 100, 2) : 0;
        $getSelisihPengeluaran = ($getTotalPengeluaranYesterday - $getTotalPengeluaranMinusTwoDay);
        $persentaseSelisihPengeluaran = $getTotalPengeluaranMinusTwoDay > 0 ? round(($getSelisihPengeluaran / $getTotalPengeluaranMinusTwoDay) * 100, 2) : 0;
        $getSelisihSaldo = ($getSaldoYesterday - $getSaldoMinusTwoDay);
        $persentaseSelisihSaldo = $getSaldoMinusTwoDay > 0 ? round(($getSelisihSaldo / $getSaldoMinusTwoDay) * 100, 2) : 0;

        // Hitung perbandingan pendapatan dari bulan lalu ke bulan tanggal berjalan sekarang
        $tanggalAwalBulanLalu = Carbon::now()->startOfMonth()->subMonthsNoOverflow()->toDateString();
        $tanggalAkhirBulanLalu = Carbon::now()->subMonthsNoOverflow()->endOfMonth()->toDateString();
        $tanggalAwalBulan = Carbon::now()->startOfMonth()->toDateString();
        $tanggalSekarang = Carbon::now()->toDateString();
        $getTotalPendapatanBulanLalu = Transaksi::whereBetween('tanggal', [$tanggalAwalBulanLalu, $tanggalAkhirBulanLalu])->where('jenis_transaksi_id', [1, 2])->where('user_id', $getId)->where('void', false)->select('jumlah')->sum('jumlah');
        $getTotalPendapatanBulanBerjalan = Transaksi::whereBetween('tanggal', [$tanggalAwalBulan, $tanggalSekarang])->where('jenis_transaksi_id', [1, 2])->where('user_id', $getId)->where('void', false)->select('jumlah')->sum('jumlah');

SELECT * FROM `transaksis` WHERE `user_id` = 3 and `void` = 0 and month(`tanggal`) = '12'
---
    public static function getJumlahPengeluaranBudgeting()
    {
        $jumlahAnggaran = Anggaran::where('user_id', auth()->user()->id)->sum('jumlah');


        $jumlahTransaksi = Transaksi::where('user_id', auth()->user()->id)->where('void', false)->whereMonth('tanggal', (isset(request()->month) ? request()->month : DatabaseHelper::getMonth()))->whereIn('jenis_transaksi_id', [3, 4])->sum('jumlah');