app/Helper/DatabaseHelper.php

    public static function getPersentaseTabungan()
    {
        $userId = auth()->user()->id;

        $jumlahPendapatan = Transaksi::where('user_id', $userId)->where('void', false)->whereMonth('created_at', DatabaseHelper::getMonth())->where('jenis_transaksi_id', 1)->sum('jumlah');
        $jumlahTabungan = Transaksi::where('user_id', $userId)->where('void', false)->whereMonth('created_at', DatabaseHelper::getMonth())->where('jenis_transaksi_id', 3)->sum('jumlah');

        $dataTabungan = Kategori_anggaran::where('user_id', $userId)->where('nama', 'tabungan')->value('value');
---
SELECT `value` FROM `kategori_anggarans` WHERE `user_id` = 1 and `nama` = 'tabungan' LIMIT 1

    public static function getMonthTransaki()
    {
        return Transaksi::where('user_id', auth()->user()->id)
                            ->where('void', false)
                            ->selectRaw('DATE_FORMAT(tanggal, "%M") as bulan_transaksi')
                            ->selectRaw('DATE_FORMAT(tanggal, "%m") as id_bulan')
                            ->distinct()
                            ->get();
---
SELECT distinct DATE_FORMAT(tanggal, "%M") as bulan_transaksi, DATE_FORMAT(tanggal, "%m") as id_bulan FROM `transaksis` WHERE `user_id` = 1 and `void` = 0

    public static function getUser()
    {
        return User::where('id', auth()->user()->id)->get();
---
SELECT * FROM `users` WHERE `id` = 1

    public static function getTransaksiPemasukanGroupByKategori()
    {
        $transaksi = Transaksi::join('kategori_transaksis', 'transaksis.kategori_transaksi_id', '=', 'kategori_transaksis.id')
                        ->where('transaksis.user_id', auth()->user()->id)
                        ->where('void', false)
                        ->where('transaksis.jenis_transaksi_id', 1);

        if(request()->id == 'all') {
            $transaksi ->select('kategori_transaksis.nama', DB::raw('SUM(transaksis.jumlah) as jumlah'))
            ->groupBy('kategori_transaksis.nama', 'transaksis.kategori_transaksi_id')->get();
        }else{
            $transaksi->whereMonth('tanggal', request()->id)->select('kategori_transaksis.nama', DB::raw('SUM(transaksis.jumlah) as jumlah'))
            ->groupBy('kategori_transaksis.nama', 'transaksis.kategori_transaksi_id');
        }

        return $transaksi->get();
---
SELECT `kategori_transaksis`.`nama`, SUM(transaksis.jumlah) as jumlah FROM `transaksis` inner join `kategori_transaksis` on `transaksis`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `transaksis`.`user_id` = 2 and `void` = 0 and `transaksis`.`jenis_transaksi_id` in (1, 2) GROUP BY `kategori_transaksis`.`nama`, `transaksis`.`kategori_transaksi_id`

    public static function getTransaksiPengeluaranGroupByKategori()
    {
          $transaksi = Transaksi::join('kategori_transaksis', 'transaksis.kategori_transaksi_id', '=', 'kategori_transaksis.id')
                        ->where('transaksis.user_id', auth()->user()->id)
                        ->where('void', false)
                        ->where('transaksis.jenis_transaksi_id', 2);

        if(request()->id == 'all') {
            $transaksi ->select('kategori_transaksis.nama', DB::raw('SUM(transaksis.jumlah) as jumlah'))
            ->groupBy('kategori_transaksis.nama', 'transaksis.kategori_transaksi_id')->get();
        }else{
            $transaksi->whereMonth('tanggal', request()->id)->select('kategori_transaksis.nama', DB::raw('SUM(transaksis.jumlah) as jumlah'))
            ->groupBy('kategori_transaksis.nama', 'transaksis.kategori_transaksi_id');
        }

        return $transaksi->get();
---
SELECT `kategori_transaksis`.`nama`, SUM(transaksis.jumlah) as jumlah FROM `transaksis` inner join `kategori_transaksis` on `transaksis`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `transaksis`.`user_id` = 2 and `void` = 0 and `transaksis`.`jenis_transaksi_id` in (3, 4) GROUP BY `kategori_transaksis`.`nama`, `transaksis`.`kategori_transaksi_id`
SELECT * FROM `users` WHERE `id` = 3