app/Http/Controllers/aksesLevelController.php

    public function index()
    {
        return view('dashboard.admin.aksesLevel.index', [
            'data' => Role::all()
        ]);
---
SELECT * FROM `roles`

    public function editAksesLevel()
    {
        $user = Role::where('id', request()->id)->first();

        // $directPermissions = $user->getAllPermissions();
        // return $directPermissions;


        $rolePermissions = $user->getAllPermissions()->pluck('name')->toArray();


        // return $rolePermissions;
        return view('dashboard.admin.aksesLevel.layouts.editAksesLevel.index', [
            'user' => User::where('id', auth()->user()->id)->get()[0],
            'data' => Role::where('id', request()->id)->get()[0],
            'rolePermissions' => $rolePermissions,
        ]);
---
SELECT * FROM `roles` WHERE `id` = '5' LIMIT 1
SELECT * FROM `users` WHERE `id` = 1
SELECT * FROM `roles` WHERE `id` = '5'

    public function editPermission(Request $request)
    {
        $role = Role::where('id', request()->id)->first();
---
SELECT * FROM `roles` WHERE `id` = '5' LIMIT 1