app/Http/Controllers/AnggaranController.php

SELECT * FROM `kategori_anggarans` WHERE `user_id` = 32
---
    public function index()
    {



        // return $persentase;

        // return DatabaseHelper::getPersentaseAnggaran();
        // return Anggaran::where('user_id', auth()->user()->id)->get();
        // return DatabaseHelper::getPersentaseBudgeting();
        // return Transaksi::where('user_id', auth()->user()->id)->where('jenis_transaksi_id', 2)->sum('jumlah');
        return view('dashboard.anggaran.index', [
            'Anggaran' => DatabaseHelper::getPersentaseAnggaran(),
            'dataBudgeting' => DatabaseHelper::getJumlahBudgeting(),
            'persentaseBudgeting' => DatabaseHelper::getPersentaseBudgeting(),
            'getBudgeting' => Kategori_anggaran::where('user_id', auth()->user()->id)->get(),
            'kategoriAnggarans' => Kategori_anggaran::where('user_id', auth()->user()->id)->get(),
            'persentaseTabungan' => DatabaseHelper::getPersentaseTabungan()
        ]);