app/Http/Controllers/DashboardController.php

    public function index()
    {
        $saldo = Transaksi::join('jenis_transaksis', 'transaksis.jenis_transaksi_id', '=', 'jenis_transaksis.id')
            ->where('transaksis.user_id', auth()->user()->id)
            ->where('transaksis.void', false)
            ->select(
                DB::raw('SUM(CASE WHEN jenis_transaksis.id IN (1,2) THEN transaksis.jumlah ELSE 0 END) - (SUM(CASE WHEN jenis_transaksis.id IN (3,4) THEN transaksis.jumlah ELSE 0 END) + SUM(CASE WHEN jenis_transaksis.id = 5 THEN transaksis.jumlah ELSE 0 END)) AS saldo')
            )
            ->get();






        $topPengeluaran = Transaksi::join('kategori_transaksis', 'transaksis.kategori_transaksi_id', '=', 'kategori_transaksis.id')
            ->select('kategori_transaksi_id', 'kategori_transaksis.nama',  DB::raw('SUM(jumlah) as total_jumlah'))
            ->where('transaksis.user_id', auth()->user()->id)
            ->where('void', false)
            ->whereMonth('transaksis.created_at', DatabaseHelper::getMonth())
            ->whereIn('transaksis.jenis_transaksi_id', [3, 4])
            ->groupBy('kategori_transaksi_id', 'kategori_transaksis.nama')
            ->orderByDesc('total_jumlah')
            ->limit(7)->get();



        // Hasilnya adalah koleksi yang sudah digabungkan


        return view('dashboard.index', [
            'pendapatan' => Transaksi::where('user_id', auth()->user()->id)
                ->whereIn('jenis_transaksi_id', [1, 2])
                ->where('void', false)
                ->sum('jumlah'),
            'pendapatan_bulan_ini' => Transaksi::where('user_id', auth()->user()->id)
                ->whereIn('jenis_transaksi_id', [1, 2])
                ->where('void', false)
                ->whereMonth('tanggal', DatabaseHelper::getMonth())
                ->sum('jumlah'),
            'pengeluaran' => Transaksi::where('user_id', auth()->user()->id)
                ->whereIn('jenis_transaksi_id', [3, 4])
                ->where('void', false)
                ->sum('jumlah'),
            'saldo' => $saldo,
            'jumlahTabungan' => Transaksi::where('user_id', auth()->user()->id)->where('jenis_transaksi_id', 5)->where('void', false)->sum('jumlah'),
            'transaksiTerkini' => Transaksi::where('user_id', auth()->user()->id)
                ->where('void', false)
                ->whereDate('tanggal', '>=', Carbon::now()->subDays(7)->format('Y-m-d'))
                ->whereDate('tanggal', '<=', Carbon::now()->format('Y-m-d'))
                ->limit(7)->get(),
            'anggarans' => DatabaseHelper::getPersentaseAnggaran(),
            'topPengeluaran' => $topPengeluaran,
            'dataBudgeting' => DatabaseHelper::getJumlahBudgeting(),
            'persentaseBudgeting' => DatabaseHelper::getPersentaseBudgeting(),
            'getBudgeting' => Kategori_anggaran::where('user_id', auth()->user()->id)->get(),
---
SELECT SUM(CASE WHEN jenis_transaksis.id IN (1,2) THEN transaksis.jumlah ELSE 0 END) - (SUM(CASE WHEN jenis_transaksis.id IN (3,4) THEN transaksis.jumlah ELSE 0 END) + SUM(CASE WHEN jenis_transaksis.id = 5 THEN transaksis.jumlah ELSE 0 END)) AS saldo FROM `transaksis` inner join `jenis_transaksis` on `transaksis`.`jenis_transaksi_id` = `jenis_transaksis`.`id` WHERE `transaksis`.`user_id` = 3 and `transaksis`.`void` = 0
SELECT `kategori_transaksi_id`, `kategori_transaksis`.`nama`, SUM(jumlah) as total_jumlah FROM `transaksis` inner join `kategori_transaksis` on `transaksis`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `transaksis`.`user_id` = 3 and `void` = 0 and month(`transaksis`.`created_at`) = '12' and `transaksis`.`jenis_transaksi_id` in (3, 4) GROUP BY `kategori_transaksi_id`, `kategori_transaksis`.`nama` ORDER BY `total_jumlah` DESC LIMIT 7
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 32 and `jenis_transaksi_id` in (1, 4) and `void` = 0
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 32 and `jenis_transaksi_id` in (1, 4) and `void` = 0 and month(`tanggal`) = '12'
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 32 and `jenis_transaksi_id` in (2, 5) and `void` = 0
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 32 and `jenis_transaksi_id` = 3 and `void` = 0
SELECT * FROM `transaksis` WHERE `user_id` = 3 and `void` = 0 and date(`tanggal`) >= '2023-12-05' and date(`tanggal`) <= '2023-12-12' LIMIT 7
SELECT * FROM `kategori_anggarans` WHERE `user_id` = 2

    public function get_persentase()
    {
        $jumlah_pendapatan = Transaksi::join('jenis_transaksis', 'transaksis.jenis_transaksi_id', '=', 'jenis_transaksis.id')
            ->where('transaksis.user_id', auth()->user()->id)
            ->where('void', false)
            ->select(
                DB::raw('SUM(CASE WHEN jenis_transaksis.id IN (1,2) THEN transaksis.jumlah ELSE 0 END) - (SUM(CASE WHEN jenis_transaksis.id IN (3,4) THEN transaksis.jumlah ELSE 0 END) + SUM(CASE WHEN jenis_transaksis.id = 3 THEN transaksis.jumlah ELSE 0 END)) AS saldo')
            )
            ->get();

        $jumlah_anggaran = Anggaran::where('user_id', auth()->user()->id)
            ->sum('jumlah');
---
SELECT SUM(CASE WHEN jenis_transaksis.id IN (1, 4) THEN transaksis.jumlah ELSE 0 END) - (SUM(CASE WHEN jenis_transaksis.id IN (2, 5) THEN transaksis.jumlah ELSE 0 END) + SUM(CASE WHEN jenis_transaksis.id = 3 THEN transaksis.jumlah ELSE 0 END)) AS saldo FROM `transaksis` inner join `jenis_transaksis` on `transaksis`.`jenis_transaksi_id` = `jenis_transaksis`.`id` WHERE `transaksis`.`user_id` = 32 and `void` = 0
SELECT sum(`jumlah`) as aggregate FROM `anggarans` WHERE `user_id` = 32

    public function get_perbandingan_pemasukan_pengeluaran()
    {
        $data_jumlah_pendapatan = Transaksi::where('user_id', auth()->user()->id)
            ->whereIn('jenis_transaksi_id', [1, 2])
            ->where('void', false)
            ->whereMonth('tanggal', DatabaseHelper::getMonth())
            ->sum('jumlah');
        $data_jumlah_pengeluaran = Transaksi::where('user_id', auth()->user()->id)
            ->whereIn('jenis_transaksi_id', [3, 4])
            ->where('void', false)
            ->whereMonth('tanggal', DatabaseHelper::getMonth())
            ->sum('jumlah');
---
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 32 and `jenis_transaksi_id` in (1, 4) and `void` = 0 and month(`tanggal`) = '12'
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 32 and `jenis_transaksi_id` in (2, 5) and `void` = 0 and month(`tanggal`) = '12'

    public function getBudgeting()
    {
        $jumlahPendapatanTransaksi = Transaksi::where('user_id', auth()->user()->id)
            ->where('kategori_transaksi_id', 1)
            ->sum('jumlah');


        $jumlahBudgeting = Kategori_anggaran::select(
            'nama',
            'id',
            DB::raw("($jumlahPendapatanTransaksi * value / 100) AS jumlah")
        )
            ->where('user_id', auth()->user()->id)
            ->get();
---
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 32 and `kategori_transaksi_id` = 1
SELECT `nama`, `id`, (51445004 * value / 100) AS jumlah FROM `kategori_anggarans` WHERE `user_id` = 3