app/Http/Controllers/feedbackManage.php

    public function detail()
    {
        // return  feedbackCenter::where('id', request()->id)
        // ->with('users_id', 'progres_dev_by')
        // ->get();
        return view('dashboard.admin.feedback.layouts.detail_feedback',[
            'user' => User::where('id', auth()->user()->id)->first(),
            'data' => feedbackCenter::where('id', request()->id)
                                    ->with('users_id', 'progres_dev_by')
                                    ->get()
        ]);
---
SELECT * FROM `users` WHERE `id` = 1 LIMIT 1