app/Http/Controllers/KategoriAnggaranController.php

SELECT * FROM `kategori_anggarans` WHERE `user_id` = 32
---
    public static function getKategoriAnggaran()
    {
        return Kategori_anggaran::where('user_id', auth()->user()->id)->get();