app/Http/Controllers/KategoriTransaksiController.php

    public function index()
    {
        return view('dashboard.kategori.index', [
            'jenis_transaksi' => Jenis_transaksi::all(),
            'kategori_transaksi' => Kategori_transaksi::where('default', true)->orWhere('user_id', auth()->user()->id)->with('jenis_transaksi')->paginate(20),
            'user' => DatabaseHelper::getUser()[0]
        ]);
---
SELECT * FROM `jenis_transaksis` WHERE `jenis_transaksis`.`id` in (1, 2, 3)
SELECT * FROM `kategori_transaksis` WHERE `default` = 1 or `user_id` = 1 LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `kategori_transaksis` WHERE `default` = 1 or `user_id` = 1
SELECT * FROM `jenis_transaksis` WHERE `jenis_transaksis`.`id` in (1, 2, 3, 4)

    public function api() {
        $results = Kategori_transaksi::where(function ($query) {
            $query->where('jenis_transaksi_id', request()->id)
                  ->where('user_id', auth()->user()->id);
        })->orWhere(function ($query) {
            $query->where('jenis_transaksi_id', request()->id)
                  ->where('default', true);
        })->get();
---
SELECT * FROM `kategori_transaksis` WHERE (`jenis_transaksi_id` = '1' and `user_id` = 1) or (`jenis_transaksi_id` = '1' and `default` = 1)

    public function api2()
    {
        return Kategori_transaksi::where('id', request()->id)->get();
---
SELECT * FROM `kategori_transaksis` WHERE `id` = '1'

    public function manageKategori()
    {
        return view('dashboard.admin.manageKategori.index', [
            'jenis_transaksi' => Jenis_transaksi::all(),
            'kategori_transaksi' => Kategori_transaksi::where('default', true)->with('jenis_transaksi')->paginate(20),
            'user' => DatabaseHelper::getUser()[0]
        ]);
---
SELECT * FROM `jenis_transaksis` WHERE `jenis_transaksis`.`id` in (1, 2, 3)
SELECT * FROM `kategori_transaksis` WHERE `default` = 1 LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `kategori_transaksis` WHERE `default` = 1