app/Http/Controllers/LaporanController.php

    public function showLaporanPemasukan()
    {

        return view('dashboard.laporan.pemasukan.index', [
            'pemasukan' => DatabaseHelper::getPendapatan(),
            'data' => Transaksi::join('kategori_transaksis', 'transaksis.kategori_transaksi_id', '=', 'kategori_transaksis.id')
                ->where('transaksis.user_id', auth()->user()->id)
                ->whereIn('transaksis.jenis_transaksi_id', [1, 2])
                ->whereIn('kategori_transaksis.jenis_transaksi_id', [1, 2])
                ->where('void', false)
                ->with(['kategori_transaksi', 'jenis_transaksi', 'suppliers_or_customers'])
                ->paginate(15),
            'kategori' => Transaksi::join('kategori_transaksis', 'transaksis.kategori_transaksi_id', '=', 'kategori_transaksis.id')
                ->where('transaksis.user_id', auth()->user()->id)
                ->where('void', false)
                ->whereIn('transaksis.jenis_transaksi_id', [1, 2])
                ->distinct()
                ->select('kategori_transaksis.nama', 'kategori_transaksis.id')
                ->groupBy('kategori_transaksis.nama', 'kategori_transaksis.id')
                ->get(),
            'dataBulan' => DatabaseHelper::getMonthTransaki(),
            'user' => DatabaseHelper::getUser()[0]
        ]);
---
SELECT distinct `kategori_transaksis`.`nama`, `kategori_transaksis`.`id` FROM `transaksis` inner join `kategori_transaksis` on `transaksis`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `transaksis`.`user_id` = 2 and `void` = 0 and `transaksis`.`jenis_transaksi_id` in (1, 2) GROUP BY `kategori_transaksis`.`nama`, `kategori_transaksis`.`id`
SELECT * FROM `jenis_transaksis` WHERE `jenis_transaksis`.`id` in (1, 2)
SELECT * FROM `kategori_transaksis` WHERE `kategori_transaksis`.`id` in (1, 2, 3, 4, 5, 6)
SELECT * FROM `suppliers_or_customers` WHERE `suppliers_or_customers`.`id` in (2)
SELECT * FROM `transaksis` inner join `kategori_transaksis` on `transaksis`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `transaksis`.`user_id` = 3 and `transaksis`.`jenis_transaksi_id` in (1, 2) and `kategori_transaksis`.`jenis_transaksi_id` in (1, 2) and `void` = 0 LIMIT 15 offset 0
SELECT `kategori_transaksis`.`nama`, SUM(transaksis.jumlah) as jumlah FROM `transaksis` inner join `kategori_transaksis` on `transaksis`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `transaksis`.`user_id` = 2 and `transaksis`.`jenis_transaksi_id` in (1, 2) and `kategori_transaksis`.`jenis_transaksi_id` in (1, 2) and `void` = 0 GROUP BY `kategori_transaksis`.`nama`, `transaksis`.`kategori_transaksi_id` LIMIT 15 offset 0

    public function showLaporanPengeluaran()
    {
        return view('dashboard.laporan.pengeluaran.index', [
            'data' => Transaksi::join('kategori_transaksis', 'transaksis.kategori_transaksi_id', '=', 'kategori_transaksis.id')
                                ->where('transaksis.user_id', auth()->user()->id)
                                ->whereIn('transaksis.jenis_transaksi_id', [3,4])
                                ->whereIn('kategori_transaksis.jenis_transaksi_id', [3,4])
                                ->where('void', false)
                                ->with(['kategori_transaksi', 'jenis_transaksi', 'suppliers_or_customers'])
                                ->paginate(15),
            'pengeluaran' => Transaksi::where('user_id', auth()->user()->id)
                ->whereIn('jenis_transaksi_id', [3, 4])
                ->where('void', false)
                ->sum('jumlah'),
            'kategori' => Transaksi::join('kategori_transaksis', 'transaksis.kategori_transaksi_id', '=', 'kategori_transaksis.id')
                ->where('transaksis.user_id', auth()->user()->id)
                ->where('void', false)
                ->whereIn('transaksis.jenis_transaksi_id', [3, 4])
                ->distinct()
                ->select('kategori_transaksis.nama', 'kategori_transaksis.id')
                ->groupBy('kategori_transaksis.nama', 'kategori_transaksis.id')
                ->get(),
            'dataBulan' => DatabaseHelper::getMonthTransaki(),
            'user' => DatabaseHelper::getUser()[0]
        ]);
---
SELECT count(*) as aggregate FROM `transaksis` inner join `kategori_transaksis` on `transaksis`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `transaksis`.`user_id` = 2 and `transaksis`.`jenis_transaksi_id` in (3, 4) and `kategori_transaksis`.`jenis_transaksi_id` in (3, 4) and `void` = 0
SELECT distinct `kategori_transaksis`.`nama`, `kategori_transaksis`.`id` FROM `transaksis` inner join `kategori_transaksis` on `transaksis`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `transaksis`.`user_id` = 2 and `void` = 0 and `transaksis`.`jenis_transaksi_id` in (3, 4) GROUP BY `kategori_transaksis`.`nama`, `kategori_transaksis`.`id`
SELECT * FROM `jenis_transaksis` WHERE `jenis_transaksis`.`id` in (3, 4)
SELECT * FROM `kategori_transaksis` WHERE `kategori_transaksis`.`id` in (7, 8, 10, 11, 12, 13, 14, 15, 16)
SELECT * FROM `suppliers_or_customers` WHERE `suppliers_or_customers`.`id` in (1)
SELECT * FROM `transaksis` inner join `kategori_transaksis` on `transaksis`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `transaksis`.`user_id` = 2 and `transaksis`.`jenis_transaksi_id` in (3, 4) and `kategori_transaksis`.`jenis_transaksi_id` in (3, 4) and `void` = 0 LIMIT 15 offset 0
SELECT sum(`jumlah`) as aggregate FROM `transaksis` WHERE `user_id` = 2 and `jenis_transaksi_id` in (3, 4) and `void` = 0

    public function showLaporanLabaRugi()
    {
        $transaksi = Transaksi::where('user_id', auth()->user()->id)
            ->where('void', false);
        $namaBulan = null;


        $labaRugi = Transaksi::join('jenis_transaksis', 'transaksis.jenis_transaksi_id', '=', 'jenis_transaksis.id')
            ->where('transaksis.user_id', auth()->user()->id)
            ->where('transaksis.void', false)
            ->select(
                DB::raw('SUM(CASE WHEN jenis_transaksis.id IN (1,2) THEN transaksis.jumlah ELSE 0 END) - (SUM(CASE WHEN jenis_transaksis.id IN (3,4) THEN transaksis.jumlah ELSE 0 END) + SUM(CASE WHEN jenis_transaksis.id = 5 THEN transaksis.jumlah ELSE 0 END)) AS saldo')
            )
            ->get();
---
SELECT * FROM `transaksis` WHERE `user_id` = 2 and `void` = 0