app/Http/Controllers/paymentController.php

INSERT INTO `payments` (`title`, `amount`, `status`, `external_id`, `url`, `user_id`, `updated_at`, `created_at`) VALUES ('langganan octans finance', '55000', 'pending', 76890, 'https://flip.id/pwf-sandbox/transaction/consolidated?redirected_from=internal&id=4f6597072e7b45409b1b3fca4730ea09', 30, '2023-12-07 15:25:25', '2023-12-07 15:25:25')
SELECT `id` FROM `payments` WHERE `user_id` = 30 LIMIT 1
UPDATE `users` SET `payment_id` = 20, `users`.`updated_at` = '2023-12-07 15:25:25' WHERE `id` = 30
---
        $payment->url = $dataResponse->payment_url;
        $payment->user_id = auth()->user()->id;

        if($payment->save()){
            $paymenId = Payment::where('user_id', auth()->user()->id)->value('id');
            User::where('id', auth()->user()->id)->update(['payment_id' => $paymenId]);

SELECT * FROM `payments` WHERE `status` = 'pending' LIMIT 15 offset 0
SELECT * FROM `users` WHERE `users`.`id` in (1, 23, 24, 30)
SELECT count(*) as aggregate FROM `payments` WHERE `status` = 'pending'
SELECT * FROM `payments` LIMIT 15 offset 0
SELECT * FROM `users` WHERE `users`.`id` in (1, 22, 23, 24, 26, 27, 28, 29)
SELECT count(*) as aggregate FROM `payments`
---
    public function paymentManage()
    {
        $payment = Payment::with('user');

        if(request()->has('status')){
            $payment->where('status', request()->status)->paginate(15);
        }else{
            $payment->paginate(15);
        }

        // return $payment->paginate(15);

        return view('user.payments.paymentManage.index', [
            'data' => $payment->paginate(15)
        ]);

SELECT * FROM `payments` WHERE `external_id` = '73798'
SELECT * FROM `users` WHERE `users`.`id` in (1)
---
    public function paymentByExternalId()
    {
        $payment = Payment::with('user')->where('external_id', request()->search)->get();