app/Http/Controllers/TransaksiController.php

    public function index()
    {
        // $a = Transaksi::with(['kategori_transaksi', 'jenis_transaksi'])
        // ->where('user_id', Auth::id())
        // ->orderBy('created_at', 'desc')
        // ->paginate(20);
        // return response()->json($a);
        return view('dashboard.transaksi.index', [
            'jenis_transaksi' => Jenis_transaksi::all(),
            'transaksi' => Transaksi::with(['kategori_transaksi', 'jenis_transaksi', 'suppliers_or_customers'])
                ->where('user_id', Auth::id())
                ->where('void', false)
                ->orderBy('created_at', 'desc')
                ->paginate(15),
            'dataBulan' => DatabaseHelper::getMonthTransaki(),
            'user' => DatabaseHelper::getUser()[0]
        ]);
---
SELECT * FROM `jenis_transaksis` WHERE `jenis_transaksis`.`id` in (1, 2, 3, 4)
SELECT * FROM `kategori_transaksis` WHERE `kategori_transaksis`.`id` in (0, 1, 2, 3, 15)
SELECT * FROM `suppliers_or_customers` WHERE `suppliers_or_customers`.`id` in (0)
SELECT * FROM `transaksis` WHERE `user_id` = 1 and `void` = 0 ORDER BY `created_at` DESC LIMIT 15 offset 0

        }


        Transaksi::where('user_id', auth()->user()->id)
                    ->where('uuid', request()->uuid)
                    ->create($validate);
---
SELECT * FROM `transaksis` WHERE `user_id` = 3 and `uuid` = 'cfd617a3-045e-d56b-b1ae-43d7879bbea9'

    public function api3()
    {
        $transaksi = Transaksi::where('user_id', auth()->user()->id);

        if (request()->has('Semua')) {
            $transaksi->where(function ($query) {
                $query->where('deskripsi', 'like', '%' . request('Semua') . '%')
                    ->orWhere('tanggal', 'like', '%' . request('Semua') . '%')
                    ->orWhere('jumlah', 'like', '%' . request('Semua') . '%');
            });
        }

        if (request()->has('Kategori')) {
            $transaksi->whereHas('kategori_transaksi', function ($query) {
                $query->where('nama', 'like', '%' . request('Kategori') . '%');
            });
        }

        // Menambahkan orderBy untuk mengurutkan berdasarkan kolom 'tanggal' secara menurun
        $transaksi = $transaksi->orderBy('tanggal', 'desc')->get();


        if(count($transaksi) > 0) {
            foreach($transaksi as $tr) {
                $result [] = [
                    'jumlah' => $tr->jumlah,
                    'tanggal' => $tr->tanggal,
                    'kategori_transaksi' => $tr->Kategori_transaksi->nama ?? '--',
                    'uuid' => $tr->uuid,
                    'jenis_transaksi' => $tr->jenis_transaksi_id,
                    'deskripsi' => $tr->deskripsi,
                    'total_transaksi' => number_format($transaksi->sum('jumlah'), 0, ',', '.')
                ];
---
SELECT * FROM `jenis_transaksis` WHERE `jenis_transaksis`.`id` in (3)
SELECT * FROM `kategori_transaksis` WHERE `kategori_transaksis`.`id` in (8, 9, 10, 11, 12, 14, 15)
SELECT `kategori_transaksis`.`nama` as `nama_kategori_transaksi`, `transaksis`.* FROM `transaksis` inner join `kategori_transaksis` on `transaksis`.`kategori_transaksi_id` = `kategori_transaksis`.`id` WHERE `transaksis`.`uuid` = '9acfa59d-449e-4f69-9bc3-c971c097d6d7' and `transaksis`.`user_id` = 1