app/Http/Controllers/TransaksiController.php

    public function api3()
    {
        $transaksi = Transaksi::where('user_id', auth()->user()->id)
            ->where('void', false);

        if (request()->has('Semua')) {
            $transaksi->where(function ($query) {
                $query->where('deskripsi', 'like', '%' . request('Semua') . '%')
                    ->orWhere('tanggal', 'like', '%' . request('Semua') . '%')
                    ->orWhere('jumlah', 'like', '%' . request('Semua') . '%');
            });
        }

        if (request()->has('Kategori')) {
            $transaksi->whereHas('kategori_transaksi', function ($query) {
                $query->where('nama', 'like', '%' . request('Kategori') . '%');
            });
        }

        // Menambahkan orderBy untuk mengurutkan berdasarkan kolom 'tanggal' secara menurun
        $transaksi = $transaksi->orderBy('tanggal', 'desc')->get();


        if (count($transaksi) > 0) {
            foreach ($transaksi as $tr) {
                $result[] = [
                    'jumlah' => $tr->jumlah,
                    'tanggal' => $tr->tanggal,
                    'kategori_transaksi' => $tr->Kategori_transaksi->nama ?? '--',
                    'uuid' => $tr->uuid,
                    'jenis_transaksi' => $tr->jenis_transaksi_id,
                    'deskripsi' => $tr->deskripsi,
                    'total_transaksi' => number_format($transaksi->sum('jumlah'), 0, ',', '.')
                ];
---
SELECT count(*) as aggregate FROM `transaksis` WHERE `user_id` = 1 and `void` = 0 and month(`tanggal`) = '12'