app/Http/Controllers/UserController.php

    public function showUser()
    {
        $user = User::with('payment')->paginate(15);
        $role = Role::all();
---
SELECT * FROM `payments` WHERE `payments`.`id` in (0, 5, 7)
SELECT * FROM `users` LIMIT 15 offset 0
SELECT count(*) as aggregate FROM `users`
SELECT * FROM `roles`

    public function show(User $user)
    {
        $user = User::where('id', auth()->user()->id)->get();
---
SELECT * FROM `users` WHERE `id` = 1